# BuiltInFailures.SketchFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures Class
BuiltInFailures Class Members See Also
---
Failures about Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SketchFailures
```

Visual Basic
---
```text
Public NotInheritable Class SketchFailures
```

Visual C++
---
```text
public ref class SketchFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SketchFailures
# See Also
BuiltInFailures..::..SketchFailures Members
Autodesk.Revit.DB Namespace